// الجدول رقم 01: وضعية التعادل الحقيقي للموظفين
const List<String> table01Ranks = [
  "رئيس مهندسين في الأشغال العمومية",
  "مهندس رئيسي في الأشغال العمومية",
  "مهندس دولة في الأشغال العمومية",
  "تقني سامي في الأشغال العمومية",
  "تقني في الأشغال العمومية",
  "مساعد تقني في الأشغال العمومية",
  "متصرف مستشار",
  "متصرف رئيسي",
  "مهندس رئيسي في الإعلام الآلي",
  "أمين محفوظات رئيسي",
  "متصرف محلل",
  "أمين محفوظات محلل",
  "متصرف",
  "مساعد متصرف",
  "ملحق رئيسي للإدارة",
  "تقني سامي في الإعلام الآلي",
  "كاتب مديرية رئيسي",
  "محاسب إداري رئيسي",
  "ملحق إدارة",
  "كاتب مديرية",
  "محاسب إداري",
  "عون إدارة رئيسي",
  "عون إدارة",
  "كاتب",
  "عامل ماهر خارج الصنف",
  "سائق سيارة من الصنف الأول",
  "حاجب رئيسي",
];

// الجدول رقم 02: وضعية التعادل الحقيقي للمناصب العليا
const List<String> table02Ranks = [
  "رئيس مصلحة",
  "رئيس قسم فرعي",
  "رئيس مكتب",
  "رئيس قسم",
  "خبير",
  "رئيس مشروع تقني",
  "مكلف بالدراسات التقنية",
  "مسؤول قواعد المعطيات",
  "مكلف بالبرامج الوثائقية",
  "رئيس فرقة",
  "رئيس حظيرة",
  "رئيس ورشة",
  "رئيس مخزن",
  "مسؤول المصلحة الداخلية",
];

// الجدول رقم 03: وضعية الأعوان المتعاقدين
const List<String> table03Ranks = [
  "عون وقاية من المستوى الثاني",
  "عون وقاية من المستوى الأول",
  "عامل ماهر من المستوى الأول",
  "رئيس فرقة من المستوى الثاني",
  "رئيس فرقة من المستوى الأول",
  "سائق سيارة من المستوى الثاني",
  "سائق سيارة من المستوى الأول",
  "عامل ماهر من المستوى الرابع",
  "عامل ماهر من المستوى الثالث",
  "عامل ماهر من المستوى الثاني",
  "عامل ماهر من المستوى الأول",
  "حارس",
];

// دمج جميع الرتب في قائمة واحدة (اختياري)
const List<String> job = [
  ...table01Ranks,
  ...table02Ranks,
  ...table03Ranks,
];